"""
names:
    0: 人                  # 除第1，2，3类外的人物
    1: 动火人（未动火）     # 红色马甲，站立
    2: 动火人（正在动火）   # 红色马甲，蹲姿
    3: 看火人              # 蓝色马甲
    4: 明火                # 火焰，电焊，电火花等
    5: 灭火器              # 
    6: 消防桶              # 棕红色桶

events:
    7.	违规动火-防火间距不满足要求
    8.	违规动火-看火人脱岗
    9.	违规动火-周边未配备消防器材
    10.	违规动火-无动火证动火
    11.	违规动火-非特种工动火
"""

fire_alarm_result = {
    'refine_result': None,
    'display_info': None,
    'polygon': None,
}

translated_cls_name = {
  0: "人",                  # 除第1，2，3类外的人物
  1: "动火人(未动火)"   ,    # 红色马甲，站立
  2: "动火人(正在动火)" ,    # 红色马甲，蹲姿
  3: "看火人",              # 蓝色马甲
  4: "明火",                # 火焰，电焊，电火花等
  5: "灭火器"  ,            # 
  6: "消防桶"   ,           # 棕红色桶
}

dist_fire_operator_threshold = 0.2
bounding_dist_threshold = 0.1

polygon_dict = {
    # 'MainProcess': [[750/2336,800/1752], [1400/2336,800/1752], [1550/2336,1500/1752], [150/2336,1500/1752]],
    'fire-1': [[750/2336,600/1752], [1400/2336,600/1752], [1550/2336,1500/1752], [150/2336,1500/1752]],
    'fire-2': [[750/2336,600/1752], [1400/2336,600/1752], [1550/2336,1500/1752], [150/2336,1500/1752]],
    'fire-3': [[750/2336,600/1752], [1400/2336,600/1752], [1550/2336,1500/1752], [150/2336,1500/1752]],
    'fire-4': [[750/2336,600/1752], [1400/2336,600/1752], [1550/2336,1500/1752], [150/2336,1500/1752]],
    'fire-动火01': [[30/1920,720/1080], [30/1920,585/1080], [650/1920,460/1080], [1870/1920,605/1080], [1280/1920,950/1080]],
}
